<a href="https://colab.research.google.com/github/datapaf/Kaggle/blob/master/titanix.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [4]:
train_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

# Logistic Regression

## Preprocessing

1. Imputation
1. encode categorical features
2. scale features
3. dimension reduction (?)
4. correlating predictors

### Imputation

In [5]:
train_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
test_df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

* use mean value for age
* encode cabin with NaN values (leave it for now)
* use most frequent value for embarked
* use most frequent value for fare

In [8]:
from sklearn.impute import SimpleImputer

In [29]:
def impute(column, strategy):
    train_imputer = SimpleImputer(strategy=strategy)
    test_imputer = SimpleImputer(strategy=strategy)

    train_df[column] = train_imputer.fit_transform(train_df[[column]])
    test_df[column] = test_imputer.fit_transform(test_df[[column]])

In [30]:
# age imputation

impute(column="Age", strategy="mean")

train_df['Age'] = train_df['Age'].astype(int) 
test_df['Age'] = test_df['Age'].astype(int)

In [32]:
# embark imputation

impute(column="Embarked", strategy="most_frequent")

In [36]:
# fare imputation

impute(column="Fare", strategy="most_frequent")

### Encoding

In [40]:
train_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

* use OneHotEncoder for Sex
* use ... for Ticket
* use OneHotEncoder for Cabin
* use OneHotEncoder for Embarked

In [43]:
len(train_df["Ticket"].unique())

681

In [41]:
from sklearn.preprocessing import OneHotEncoder